Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1
The Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1 class provides a wrapper for managed-to-native objects marshaling.
Type of data. The type must be of value type and not contain any reference.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.handle
The handle.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.disposed
Indicates whether the instance has been disposed.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.#ctor(`0[])
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1 class.
items: The items.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.Pointer
Gets the pointer.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.DirectManipulation.Adapter.Native.PinMarshaler`1.Dispose(System.Boolean)
Releases unmanaged and - optionally - managed resources.
disposing: true to release both managed and unmanaged resources; false to release only unmanaged resources.